package com.example.testtask.data

class addData {

    val joblist = listOf(
        Job(
            viewersCount = "Сейчас просматривает 2 человека",
            jobTitle = "UI/UX дизайнер",
            location = "Минск, улица Бирюзова, 4/5",
            companyName = "Мобирикс",
            experience = "Опыт от 1 до 3 лет",
            publishDate = "Опубликовано 20 февраля 2024",
            isFavorite = false,
            salary = "Уровень дохода не указан",
            schedules = listOf("полная занятость", "полный день"),
            appliedNumber = 147,
            description = "Мы ищем специалиста на позицию UX/UI Designer, который вместе с коллегами будет заниматься проектированием пользовательских интерфейсов внутренних и внешних продуктов компании.",
            responsibilities = "- проектирование пользовательских сценариев и создание прототипов;\n- разработка интерфейсов для продуктов компании (Web+App);\n- работа над созданием и улучшением Дизайн-системы;\n- взаимодействие с командами frontend-разработки;\n- контроль качества внедрения дизайна;\n- ситуативно: создание презентаций и других материалов на основе фирменного стиля компании",
            questions = listOf("Где располагается место работы?", "Какой график работы?", "Вакансия открыта?", "Какая оплата труда?")
        ),
        Job(
            viewersCount = "Сейчас просматривает 17 человек",
            jobTitle = "UI/UX-дизайнер / Web-дизайнер / Дизайнер интерфейсов",
            location = "Казань, улица Чистопольская, 20/10",
            companyName = "Шафигуллин Шакир",
            experience = "Опыт от 1 до 3 лет",
            publishDate = "Опубликовано 6 марта 2024",
            isFavorite = false,
            salary = "от 20 000 до 50 000 ₽ на руки",
            schedules = listOf("частичная занятость", "полный день"),
            appliedNumber = null,
            description = "Мы разрабатываем мобильные приложения, web-приложения и сайты под ключ. Нам в команду нужен UX/UI Designer!",
            responsibilities = "- Разработка дизайна Web+App (обязательно Figma)\n- Работа над созданием и улучшением систем;\n- Взаимодействие с командами frontend-разработки и backend-разработки",
            questions = listOf("Где располагается место работы?", "Какой график работы?", "Как с вами связаться?")
        ),
        Job(
            viewersCount = "Сейчас просматривает 11 человек",
            jobTitle = "UX/UI Designer",
            location = "Казань, улица Пушкина, 2",
            companyName = "Aston",
            experience = "Опыт от 3 до 6 лет",
            publishDate = "Опубликовано 28 февраля 2024",
            isFavorite = true,
            salary = "Уровень дохода не указан",
            schedules = listOf("полная занятость", "удаленная работа"),
            appliedNumber = 11,
            description = "Мы – аутсорсинговая аккредитованная IT-компания Aston, разрабатываем программное обеспечение на заказ и оказываем услуги IT-аутсорсинга предприятиям, организациям и стартапам. Приоритетные направления – финансовые технологии, телеком, ритейл, недвижимость и другие.",
            responsibilities = "- совместно с Product Owner определять бизнес-метрики, потребности клиентов банка, фиксировать их в формате задач и метрик успешности;\n- изучать лучшие практики и недостатки аналогичных продуктов, проходить путь клиента и формулировать гипотезы решения задач вместе с продуктовой командой;\n- создавать прототипы для проверки гипотез;\n- передавать прототипы на Usability-тесты и контролировать их проведение;\n- улучшать решения по результатам тестов и наблюдений;\n- готовить чистовые макеты на основе компонентов дизайн-системы банка для передачи в разработку;\n- создавать и описывать новые компоненты дизайн-системы по принятым в банке стандартам;\n- отдавать на дизайн-чек макеты и проверять решения других дизайнеров;\n- передавать макеты разработчикам и отвечать на возникающие в процессе разработки вопросы;\n- проводить дизайн-ревью результата разработки и формулировать список замечаний для разработчиков;\n- итеративно совершенствовать дизайн цифрового продукта на основе метрик и отзывов клиентов;\n- участвовать в улучшении процессов центра компетенций продуктового дизайна.",
            questions = listOf("Где располагается место работы?", "Какой график работы?", "Какая оплата труда?")
        ),
        Job(
            viewersCount = "Сейчас просматривают 7 человек",
            jobTitle = "Веб-дизайнер",
            location = "Казань, улица Пушкина, 57",
            companyName = "Алабуга. Маркетинг и PR",
            experience = "Без опыта",
            publishDate = "Опубликовано 2 марта 2024",
            isFavorite = false,
            salary = "от 60 000 ₽ до вычета налогов",
            schedules = listOf("частичная занятость", "полный день"),
            appliedNumber = 7,
            responsibilities = "- Готовить макеты на основании прототипа и/или описания пользовательских сценариев;\n- Анализировать бизнесовые и пользовательские требования, уточнять постановки от аналитиков и проектировщиков;\n- Создавать графические и стилистические элементы для портала, приложений и промо страниц;\n- Оптимизировать дизайн существующих интерфейсов;\n- Осуществлять авторский контроль над исполнителями;\n- Развивать существующую дизайн-систему и UI-киты;\n- Помогать в подготовке продающих фичи презентаций.",

            description = "- Разработка новых сайтов, приложений, лэндингов;\n- Создание и доработка прототипов готовых к сдаче в верстку;\n- Взаимодействие с подрядчиками по разработке сайтов\n- Доработка существующих сайтов;\n- Проектирование интерфейсов, организация UI/UX-исследований;\n- Взаимодействие с Frontend и Backend разработчиками, техническими специалистами;\n- Работа с дизайн системой, её поддержание.",
            questions = listOf("Где располагается место работы?", "Какой график работы?", "Вакансия открыта?", "Какая оплата труда?")
        ),
        Job(
            viewersCount = "Сейчас просматривает 29 человек",
            jobTitle = "Ведущий продуктовый дизайнер",
            location = "Минск, проспект Хасанова, 15",
            companyName = "ПАО Ростелеком",
            experience = "Опыт от 3 до 6 лет",
            publishDate = "Опубликовано 19 февраля 2024",
            isFavorite = false,
            salary = "Уровень дохода не указан",
            schedules = listOf("полная занятость", "удаленная работа"),
            appliedNumber = null,
            description = "Перед вами не просто вакансия. Перед вами — уникальные возможности, от которых вас отделяет всего один клик.",
            responsibilities = "- Готовить макеты на основании прототипа и/или описания пользовательских сценариев;\n- Анализировать бизнесовые и пользовательские требования, уточнять постановки от аналитиков и проектировщиков;\n- Создавать графические и стилистические элементы для портала, приложений и промо страниц;\n- Оптимизировать дизайн существующих интерфейсов;\n- Осуществлять авторский контроль над исполнителями;\n- Развивать существующую дизайн-систему и UI-киты;\n- Помогать в подготовке продающих фичи презентаций.",
            questions = listOf("Где располагается место работы?", "Какой график работы?", "Вакансия открыта?", "Какая оплата труда?")
        ),
        Job(
            viewersCount = "Сейчас просматривает 1 человек",
            jobTitle = "Product Designer",
            location = "Минск, улица Побратимова, 5",
            companyName = "TravelLine",
            experience = "Опыт от 3 до 6 лет",
            publishDate = "Опубликовано 2 февраля 2024",
            isFavorite = false,
            salary = "Уровень дохода не указан",
            schedules = listOf("полная занятость", "полный день"),
            appliedNumber = 1,
            description = "В TravelLine мы разрабатываем единую функциональную Платформу для автоматизации процессов гостиничного бизнеса. Всё, что связано с онлайн-бронированием и управлением номерным фондом в отелях — это к нам. Ежемесячно через наши системы бронируют более 1,5 миллионов гостей.",
            responsibilities = "- Проектировать интерфейс B2B продукта: сопровождать и улучшать текущие решения, поддерживать консистентность\n- Понимать потребности и боли пользователей, логику взаимодействия пользователя с продуктом, участвовать в этапе discovery\n- Создавать интерактивные прототипы\n- Проводить юзабилити-тестирования и ревью реализации решений\n- Работать внутри продуктовой команды: коммуницировать с дизайнерами, продакт и проджект менеджерами, аналитиками, разработчиками и тестировщиками.",
            questions = listOf("Где располагается место работы?", "Какой график работы?", "Вакансия открыта?", "Какая оплата труда?", "Как с вами связаться?")
        )
    )
}
